artilleryTest.yml
config:
  target: 'http://127.0.0.1:3003'
  phases:
    - duration: 15
      arrivalRate: 10
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
  variables:
    projectIds:
      - ["8747860", "9628153", "8491468", "9239701", "9702154", "8546007", "9198592", "9724731", "9800023", "8959885", "9015710", "8292253", "8747860", "9628153", "8491468"]
scenarios:
  - flow:
    - loop: 
        - get:
            url: "/Project {{ $loopElement }}/{{ $loopElement }}/section/comments"
      over: projectIds
    - post:
        url: "/Project 10/10/section/comments"
        json:
          avatar: "https://s3-us-west-1.amazonaws.com/pley-land/10.jpg"
          username: "KassandraC"
          backer: "Backer"
          comment: "Lorem Ipsum"
          date_prod: "2018-06-06T23:33:20.811Z"
    - post:
        url: "/Project 11/11/section/comments"
        json:
          avatar: "https://s3-us-west-1.amazonaws.com/pley-land/10.jpg"
          username: "KassandraC"
          backer: "Backer"
          comment: "Lorem Ipsum"
          date_prod: "2018-06-06T23:33:20.811Z"
    - post:
        url: "/Project 12/12/section/comments"
        json:
          avatar: "https://s3-us-west-1.amazonaws.com/pley-land/10.jpg"
          username: "KassandraC"
          backer: "Backer"
          comment: "Lorem Ipsum"
          date_prod: "2018-06-06T23:33:20.811Z"
    - post:
        url: "/Project 13/13/section/comments"
        json:
          avatar: "https://s3-us-west-1.amazonaws.com/pley-land/10.jpg"
          username: "KassandraC"
          backer: "Backer"
          comment: "Lorem Ipsum"
          date_prod: "2018-06-06T23:33:20.811Z"
    - put:
        url: "/Project 10/10/section/comments"
        json:
          username: "KassandraC"
          comment: "Lorem Ipsum test"
          date_prod: "2018-06-06T23:33:20.811Z"
    - put:
        url: "/Project 11/11/section/comments"
        json:
          username: "KassandraC"
          comment: "Lorem Ipsum test"
          date_prod: "2018-06-06T23:33:20.811Z"
    - delete:
        url: "/Project 10/10/section/comments"
        json:
          username: "KassandraC"
          comment: "Lorem Ipsum test"
    - delete:
        url: "/Project 11/11/section/comments"
        json:
          username: "KassandraC"
          comment: "Lorem Ipsum test"
    - delete:
        url: "/Project 12/12/section/comments"
        json:
          username: "KassandraC"
          comment: "Lorem Ipsum"
    - delete:
        url: "/Project 13/13/section/comments"
        json:
          username: "KassandraC"
          comment: "Lorem Ipsum"